<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"649199b8295c4af202f6adc5017b0d60aabd8d5fb9482c57a58d125623be064c","plan_job_ref":"Job .github/workflows/_test-tf.yaml #290 at https://github.com/tx-pts-dai/github-workflows/actions/runs/13516276044","plan_out_hash":"137baaac899612fa82b9d99077a5a18241934e9431175dbe298fb8ae1f68c0da","plan_hash":"1356e7d2d864c86b953f64b93a37effbff0e94e2b9b38f1b278cb56412300d05","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #290](https://github.com/tx-pts-dai/github-workflows/actions/runs/13516276044)